# Для Python можно выделить три основных пакетных менеджера:
# pip;
# pipenv;
# conda
# Менеджер pip является модулем, написанным на Python, и позволяет работать только с установкой Python-пакетов.
#
# Pipenv использует связку pip и virtualenv, что упрощает их использование с помощью одного интерфейса командной строки.
#
# Conda обладает немного большим функционалом и может устанавливать пакеты не только для Python. Плюс conda решает
# некоторые вопросы, связанные с установкой пакетов, которые используют сложные зависимости, в том числе
# платформозависимые (особенно этим грешат различные научные пакеты).

# Вы можете создать «виртуальное окружение», внутри которого копируется интерпретатор, от которого данное
# окружение было создано, и стандартные модули (os, sys…).
# Создавая виртуальное окружение, вы изолируетесь от других проектов.
#
# Итоговое задание
# Чтобы закрепить пройденный материал, вам необходимо будет самостоятельно выполнить следующее задание.
#
# Установить на свой компьютер интерпретатор Python последней версии
# Создать в PyCharm два проекта, для каждого создать новое виртуальное окружение.
# Установить в каждое окружение по 2 пакета, отличных от тех, которые использовались ранее.
